fabiangv29/Esp8266/boards.txt
moes_t1_3.menu.ip.lm6f=v2 IPv6 Lower Memory
moes_t1_3.menu.ip.lm6f.build.lwip_include=lwip2/include
moes_t1_3.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
moes_t1_3.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
moes_t1_3.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
moes_t1_3.menu.ip.hb6f.build.lwip_include=lwip2/include
moes_t1_3.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
moes_t1_3.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
moes_t1_3.menu.dbg.Disabled=Disabled
moes_t1_3.menu.dbg.Disabled.build.debug_port=
moes_t1_3.menu.dbg.Serial=Serial
moes_t1_3.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
moes_t1_3.menu.dbg.Serial1=Serial1
moes_t1_3.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
moes_t1_3.menu.lvl.None____=None
moes_t1_3.menu.lvl.None____.build.debug_level=
moes_t1_3.menu.lvl.SSL=SSL
moes_t1_3.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
moes_t1_3.menu.lvl.TLS_MEM=TLS_MEM
moes_t1_3.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
moes_t1_3.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
moes_t1_3.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
moes_t1_3.menu.lvl.HTTP_SERVER=HTTP_SERVER
moes_t1_3.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
moes_t1_3.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
moes_t1_3.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
moes_t1_3.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
moes_t1_3.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
moes_t1_3.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
moes_t1_3.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
moes_t1_3.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
moes_t1_3.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
moes_t1_3.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
moes_t1_3.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
moes_t1_3.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
moes_t1_3.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
moes_t1_3.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
moes_t1_3.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
moes_t1_3.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
moes_t1_3.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
moes_t1_3.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
moes_t1_3.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
moes_t1_3.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
moes_t1_3.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
moes_t1_3.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
moes_t1_3.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
moes_t1_3.menu.lvl.CORE=CORE
moes_t1_3.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
moes_t1_3.menu.lvl.WIFI=WIFI
moes_t1_3.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
moes_t1_3.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
moes_t1_3.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
moes_t1_3.menu.lvl.UPDATER=UPDATER
moes_t1_3.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
moes_t1_3.menu.lvl.OTA=OTA
moes_t1_3.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
moes_t1_3.menu.lvl.OOM=OOM
moes_t1_3.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
moes_t1_3.menu.lvl.MDNS=MDNS
moes_t1_3.menu.lvl.MDNS.build.debug_level= -DDEBUG_ESP_MDNS
moes_t1_3.menu.lvl.HWDT=HWDT
moes_t1_3.menu.lvl.HWDT.build.debug_level= -DDEBUG_ESP_HWDT
moes_t1_3.menu.lvl.HWDT_NOEXTRA4K=HWDT_NOEXTRA4K
moes_t1_3.menu.lvl.HWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_HWDT_NOEXTRA4K
moes_t1_3.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
moes_t1_3.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
moes_t1_3.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
moes_t1_3.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
moes_t1_3.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
moes_t1_3.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
moes_t1_3.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
moes_t1_3.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
moes_t1_3.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
moes_t1_3.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
moes_t1_3.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
moes_t1_3.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
moes_t1_3.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
moes_t1_3.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
moes_t1_3.menu.wipe.none=Only Sketch
moes_t1_3.menu.wipe.none.upload.erase_cmd=
moes_t1_3.menu.wipe.sdk=Sketch + WiFi Settings
moes_t1_3.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
moes_t1_3.menu.wipe.all=All Flash Contents
moes_t1_3.menu.wipe.all.upload.erase_cmd=erase_flash
moes_t1_3.menu.baud.115200=115200
moes_t1_3.menu.baud.115200.upload.speed=115200
moes_t1_3.menu.baud.57600=57600
moes_t1_3.menu.baud.57600.upload.speed=57600
moes_t1_3.menu.baud.230400.linux=230400
moes_t1_3.menu.baud.230400.macosx=230400
moes_t1_3.menu.baud.230400.upload.speed=230400
moes_t1_3.menu.baud.256000.windows=256000
moes_t1_3.menu.baud.256000.upload.speed=256000
moes_t1_3.menu.baud.460800.linux=460800
moes_t1_3.menu.baud.460800.macosx=460800
moes_t1_3.menu.baud.460800.upload.speed=460800
moes_t1_3.menu.baud.512000.windows=512000
moes_t1_3.menu.baud.512000.upload.speed=512000
moes_t1_3.menu.baud.921600=921600
moes_t1_3.menu.baud.921600.upload.speed=921600
moes_t1_3.menu.baud.3000000=3000000
moes_t1_3.menu.baud.3000000.upload.speed=3000000
moes_t1_3.menu.eesz.autoflash=Mapping defined by Hardware and Sketch
moes_t1_3.menu.eesz.autoflash.build.flash_size=16M
moes_t1_3.menu.eesz.autoflash.build.flash_ld=eagle.flash.auto.ld
moes_t1_3.menu.eesz.autoflash.build.extra_flags=-DFLASH_MAP_SUPPORT=1
moes_t1_3.menu.eesz.autoflash.upload.maximum_size=1044464

